Thank you for opening the issue @acwwat . I can reproduce it with the instance example you have provided.

On the subsequent apply:
```
awscc_lightsail_instance.example: Refreshing state... [id=example-instance]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # awscc_lightsail_instance.example will be updated in-place
  ~ resource "awscc_lightsail_instance" "example" {
      + add_ons            = (known after apply)
        id                 = "example-instance"
      + tags               = (known after apply)
      + user_data          = (known after apply)
        # (18 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

The statefile on the initial apply is missing values for the above fields and are marked as null. 

```
{
  "version": 4,
  "terraform_version": "1.8.4",
  "resources": [
    {
      "mode": "managed",
      "type": "awscc_lightsail_instance",
      "name": "example",
      "provider": "provider[\"registry.terraform.io/hashicorp/awscc\"]",
      "instances": [
        {
          "schema_version": 1,
          "attributes": {
            "add_ons": null,
            .......
            "tags": null,
            "user_data": null,
            "user_name": "ec2-user"
          },
          "sensitive_attributes": []
        }
      ]
    }
  ],
  "check_results": null
}

```